YuZane/ExpressTrain/Device/MM32F5330/Include/reg_flexcan.h
/***********************************************************************************************************************
    @file     reg_flexcan.h
    @author   VV TEAM
    @brief    This flie contains all the FLEXCAN's register and its field definition.
  **********************************************************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

      Redistribution and use in source and binary forms, with or without modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and
       the following disclaimer in the documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or
       promote products derived from this software without specific prior written permission.

      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
    SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *********************************************************************************************************************/

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/

#ifndef __REG_FLEXCAN_H
#define __REG_FLEXCAN_H


/* Files includes ----------------------------------------------------------------------------------------------------*/
#include "core_starmc1.h"



/**
  * @brief FLEXCAN Base Address Definition
  */
#define  FLEXCAN_BASE                              0x4000C000                                       /*!<Base Address: 0x4000C000*/

/**
  * @brief FLEXCAN Register Structure Definition
  */
typedef struct
{
    __IO uint32_t MCR;                            /*!<FLEXCAN Module Configuration Register          offset: 0x00       */
    __IO uint32_t CTRL1;                          /*!<FLEXCAN Control Register 1                     offset: 0x04       */
    __IO uint32_t TIMER;                          /*!<FLEXCAN Free Running Timer Register            offset: 0x08       */
    __IO uint32_t RESERVED0x0C[1];                /*!<                                               offset: 0x0C       */
    __IO uint32_t RXMGMASK;                       /*!<FLEXCAN Rx Mailboxes Global Mask Register      offset: 0x10       */
    __IO uint32_t RX14MASK;                       /*!<FLEXCAN Rx 14 Mask Registe                     offset: 0x14       */
    __IO uint32_t RX15MASK;                       /*!<FLEXCAN Rx 15 Mask Register                    offset: 0x18       */
    __IO uint32_t ECR;                            /*!<FLEXCAN Error Counter Register                 offset: 0x1C       */
    __IO uint32_t ESR1;                           /*!<FLEXCAN Error and Status Register 1            offset: 0x20       */
    __IO uint32_t RESERVED0x24[1];                /*!<                                               offset: 0x24       */
    __IO uint32_t IMASK1;                         /*!<FLEXCAN Interrupt Mask Register 1              offset: 0x28       */
    __IO uint32_t RESERVED0x2C[1];                /*!<                                               offset: 0x2C       */
    __IO uint32_t IFLAG1;                         /*!<FLEXCAN Interrupt Flag Register 1              offset: 0x30       */
    __IO uint32_t CTRL2;                          /*!<FLEXCAN Control Register 2                     offset: 0x34       */
    __IO uint32_t ESR2;                           /*!<FLEXCAN Error and Status Register 2            offset: 0x38       */
    __IO uint32_t RESERVED0x3C[2];                /*!<                                               offset: 0x3C~0x40  */
    __IO uint32_t CRCR;                           /*!<FLEXCAN CRC Register                           offset: 0x44       */
    __IO uint32_t RXFGMASK;                       /*!<FLEXCAN Rx FIFO Global Mask Register           offset: 0x48       */
    __IO uint32_t RXFIR;                          /*!<FLEXCAN Rx FIFO Information Register           offset: 0x4C       */
    __IO uint32_t CBT;                            /*!<FLEXCAN CAN Bit Timing Register                offset: 0x50       */
    __IO uint32_t RESERVED_4[11];

    struct                                        /*!< offset: 0x80 array step: 0x10 x 128bit */
    {
        __IO uint32_t CS;                         /*!< Message Buffer 0 CS Register..Message Buffer 15 CS Register, array offset: 0x80, array step: 0x10 */
        __IO uint32_t ID;                         /*!< Message Buffer 0 ID Register..Message Buffer 15 ID Register, array offset: 0x84, array step: 0x10 */
        __IO uint32_t WORD0;                      /*!< Message Buffer 0 WORD0 Register..Message Buffer 15 WORD0 Register, array offset: 0x88, array step: 0x10 */
        __IO uint32_t WORD1;                      /*!< Message Buffer 0 WORD1 Register..Message Buffer 15 WORD1 Register, array offset: 0x8C, array step: 0x10 */
    }MB[32];

    __IO uint32_t RESERVED_5[384];
    __IO uint32_t RXIMR[32];                      /*!<FLEXCAN Rx Individual Mask Registers           offset: 0x880      */
    __IO uint32_t RESERVED0x900[192];             /*!<                                               offset: 0x900~0xBFC*/
    __IO uint32_t FDCTRL;                         /*!<FLEXCAN CAN FD Control Register                offset: 0xC00      */
    __IO uint32_t FDCBT;                          /*!<FLEXCAN CAN FD Bit Timing Register             offset: 0xC04      */
    __IO uint32_t FDCRC;                          /*!<FLEXCAN CAN FD CRC Register                    offset: 0xC08      */
    __IO uint32_t ERFCR;                          /*!<FLEXCAN Enhanced Rx FIFO Control Register      offset: 0xC0C      */
    __IO uint32_t ERFIER;                         /*!<FLEXCAN Enhanced Rx FIFO Interrupt Enable      offset: 0xC10
                                                      Register                                                          */
    __IO uint32_t ERFSR;                          /*!<FLEXCAN Enhanced Rx FIFO Status Register       offset: 0xC14      */
    __IO uint32_t RESERVED0xC18[1274];                  /*!<                                                      offset: 0xC18~0x1FFC */                                    
    struct 
    {   
        __IO uint32_t ERFCS;                            /*!< Enhanced Rx FIFO Buffer 0 CS Register                offset: 0x2000 */
        __IO uint32_t ERFDID;                           /*!< Enhanced Rx FIFO Buffer 0 ID Register                offset: 0x2004 */
        __IO uint32_t ERFDWORD[16];                     /*!< Enhanced Rx FIFO Buffer 0 WORD Register              offset: 0x2008 */
        __IO uint32_t IHOFF;                            /*!< Identifier receive filter hit indication             offset: 0x2048 */
        __IO uint32_t RESERVED0x204C[1];                /*!<                                                      offset: 0x204C */
    }ERFMB[6];                                          /*!<                                                      offset: 0x2000~0x21DC */
    __IO uint32_t RESERVED0x21E0[904];                  /*!<                                                      offset: 0x21E0~0x2FFC */                                     
    __IO uint32_t ERFFEL[2];                      /*!<FLEXCAN Enhanced Rx FIFO Filter Element        offset: 0x3000
                                                      Registers                                                         */
} FLEXCAN_TypeDef;

/**
  * @brief FLEXCAN type pointer Definition
  */
#define FLEXCAN                                   ((FLEXCAN_TypeDef *)FLEXCAN_BASE)


