YuZane/ExpressTrain/Device/MM32F5330/Include/reg_flexcan.h
/** @name MCR - Module Configuration Register
  * @{
  */
#define CAN_MCR_MAXMB_MASK                       (0x7FU)
#define CAN_MCR_MAXMB_SHIFT                      (0U)
#define CAN_MCR_MAXMB(x)                         (((uint32_t)(((uint32_t)(x)) << CAN_MCR_MAXMB_SHIFT)) & CAN_MCR_MAXMB_MASK)
#define CAN_MCR_IDAM_MASK                        (0x300U)
#define CAN_MCR_IDAM_SHIFT                       (8U)
/* IDAM - ID Acceptance Mode */
/* 0b00..Format A: One full ID (standard and extended) per ID Filter Table element. */
/* 0b01..Format B: Two full standard IDs or two partial 14-bit (standard and extended) IDs per ID Filter Table element. */
/* 0b10..Format C: Four partial 8-bit Standard IDs per ID Filter Table element. */
/* 0b11..Format D: All frames rejected. */

#define CAN_MCR_IDAM(x)                          (((uint32_t)(((uint32_t)(x)) << CAN_MCR_IDAM_SHIFT)) & CAN_MCR_IDAM_MASK)
#define CAN_MCR_FDEN_MASK                        (0x800U)
#define CAN_MCR_FDEN_SHIFT                       (11U)
/* FDEN - CAN FD Enable */
/* 0b0..CAN FD disabled. */
/* 0b1..CAN FD enabled. */

#define CAN_MCR_FDEN(x)                          (((uint32_t)(((uint32_t)(x)) << CAN_MCR_FDEN_SHIFT)) & CAN_MCR_FDEN_MASK)
#define CAN_MCR_AEN_MASK                         (0x1000U)
#define CAN_MCR_AEN_SHIFT                        (12U)
/* AEN - Abort Enable */
/* 0b0..Abort disabled. */
/* 0b1..Abort enabled. */

#define CAN_MCR_AEN(x)                           (((uint32_t)(((uint32_t)(x)) << CAN_MCR_AEN_SHIFT)) & CAN_MCR_AEN_MASK)
#define CAN_MCR_LPRIOEN_MASK                     (0x2000U)
#define CAN_MCR_LPRIOEN_SHIFT                    (13U)
/* LPRIOEN - Local Priority Enable */
/* 0b0..Local Priority disabled. */
/* 0b1..Local Priority enabled. */

#define CAN_MCR_LPRIOEN(x)                       (((uint32_t)(((uint32_t)(x)) << CAN_MCR_LPRIOEN_SHIFT)) & CAN_MCR_LPRIOEN_MASK)
#define CAN_MCR_DMA_MASK                         (0x8000U)
#define CAN_MCR_DMA_SHIFT                        (15U)
/* DMA - DMA Enable */
/* 0b0..DMA feature for RX FIFO disabled. */
/* 0b1..DMA feature for RX FIFO enabled. */

#define CAN_MCR_DMA(x)                           (((uint32_t)(((uint32_t)(x)) << CAN_MCR_DMA_SHIFT)) & CAN_MCR_DMA_MASK)
#define CAN_MCR_IRMQ_MASK                        (0x10000U)
#define CAN_MCR_IRMQ_SHIFT                       (16U)
/* IRMQ - Individual Rx Masking And Queue Enable */
/* 0b0..Individual Rx masking and queue feature are disabled. For backward compatibility with legacy applications, the reading of C/S word locks the MB even if it is EMPTY. */
/* 0b1..Individual Rx masking and queue feature are enabled. */

#define CAN_MCR_IRMQ(x)                          (((uint32_t)(((uint32_t)(x)) << CAN_MCR_IRMQ_SHIFT)) & CAN_MCR_IRMQ_MASK)
#define CAN_MCR_SRXDIS_MASK                      (0x20000U)
#define CAN_MCR_SRXDIS_SHIFT                     (17U)
/* SRXDIS - Self Reception Disable */
/* 0b0..Self reception enabled. */
/* 0b1..Self reception disabled. */

#define CAN_MCR_SRXDIS(x)                        (((uint32_t)(((uint32_t)(x)) << CAN_MCR_SRXDIS_SHIFT)) & CAN_MCR_SRXDIS_MASK)
#define CAN_MCR_WAKSRC_MASK                      (0x80000U)
#define CAN_MCR_WAKSRC_SHIFT                     (19U)
/* WAKSRC - Wake Up Source */
/* 0b0..FlexCAN uses the unfiltered Rx input to detect recessive to dominant edges on the CAN bus. */
/* 0b1..FlexCAN uses the filtered Rx input to detect recessive to dominant edges on the CAN bus. */

#define CAN_MCR_WAKSRC(x)                        (((uint32_t)(((uint32_t)(x)) << CAN_MCR_WAKSRC_SHIFT)) & CAN_MCR_WAKSRC_MASK)
#define CAN_MCR_LPMACK_MASK                      (0x100000U)
#define CAN_MCR_LPMACK_SHIFT                     (20U)
/* LPMACK - Low-Power Mode Acknowledge */
/* 0b0..FlexCAN is not in a low-power mode. */
/* 0b1..FlexCAN is in a low-power mode. */

#define CAN_MCR_LPMACK(x)                        (((uint32_t)(((uint32_t)(x)) << CAN_MCR_LPMACK_SHIFT)) & CAN_MCR_LPMACK_MASK)
#define CAN_MCR_WRNEN_MASK                       (0x200000U)
#define CAN_MCR_WRNEN_SHIFT                      (21U)
/* WRNEN - Warning Interrupt Enable */
/* 0b0..TWRNINT and RWRNINT bits are zero, independent of the values in the error counters. */
/* 0b1..TWRNINT and RWRNINT bits are set when the respective error counter transitions from less than 96 to greater than or equal to 96. */

#define CAN_MCR_WRNEN(x)                         (((uint32_t)(((uint32_t)(x)) << CAN_MCR_WRNEN_SHIFT)) & CAN_MCR_WRNEN_MASK)
#define CAN_MCR_SLFWAK_MASK                      (0x400000U)
#define CAN_MCR_SLFWAK_SHIFT                     (22U)
/* SLFWAK - Self Wake Up */
/* 0b0..FlexCAN Self Wake Up feature is disabled. */
/* 0b1..FlexCAN Self Wake Up feature is enabled. */

#define CAN_MCR_SLFWAK(x)                        (((uint32_t)(((uint32_t)(x)) << CAN_MCR_SLFWAK_SHIFT)) & CAN_MCR_SLFWAK_MASK)
#define CAN_MCR_SUPV_MASK                        (0x800000U)
#define CAN_MCR_SUPV_SHIFT                       (23U)
/* SUPV - Supervisor Mode */
/* 0b0..FlexCAN is in User mode. Affected registers allow both Supervisor and Unrestricted accesses. */
/* 0b1..FlexCAN is in Supervisor mode. Affected registers allow only Supervisor access. Unrestricted access behaves as though the access was done to an unimplemented register location. */

#define CAN_MCR_SUPV(x)                          (((uint32_t)(((uint32_t)(x)) << CAN_MCR_SUPV_SHIFT)) & CAN_MCR_SUPV_MASK)
#define CAN_MCR_FRZACK_MASK                      (0x1000000U)
#define CAN_MCR_FRZACK_SHIFT                     (24U)
/* FRZACK - Freeze Mode Acknowledge */
/* 0b0..FlexCAN not in Freeze mode, prescaler running. */
/* 0b1..FlexCAN in Freeze mode, prescaler stopped. */

#define CAN_MCR_FRZACK(x)                        (((uint32_t)(((uint32_t)(x)) << CAN_MCR_FRZACK_SHIFT)) & CAN_MCR_FRZACK_MASK)
#define CAN_MCR_SOFTRST_MASK                     (0x2000000U)
#define CAN_MCR_SOFTRST_SHIFT                    (25U)
/* SOFTRST - Soft Reset */
/* 0b0..No reset request. */
/* 0b1..Resets the registers affected by soft reset. */

