YuZane/ExpressTrain/Device/MM32F5330/Include/reg_flexcan.h
#define CAN_ERFSR_ERFCLR_MASK                    (0x8000000U)
#define CAN_ERFSR_ERFCLR_SHIFT                   (27U)
#define CAN_ERFSR_ERFCLR(x)                      (((uint32_t)(((uint32_t)(x)) << CAN_ERFSR_ERFCLR_SHIFT)) & CAN_ERFSR_ERFCLR_MASK)

#define CAN_ERFSR_ERFDA_MASK                     (0x10000000U)
#define CAN_ERFSR_ERFDA_SHIFT                    (28U)
#define CAN_ERFSR_ERFDA(x)                       (((uint32_t)(((uint32_t)(x)) << CAN_ERFSR_ERFDA_SHIFT)) & CAN_ERFSR_ERFDA_MASK)
#define CAN_ERFSR_ERFWMI_MASK                    (0x20000000U)
#define CAN_ERFSR_ERFWMI_SHIFT                   (29U)
#define CAN_ERFSR_ERFWMI(x)                      (((uint32_t)(((uint32_t)(x)) << CAN_ERFSR_ERFWMI_SHIFT)) & CAN_ERFSR_ERFWMI_MASK)
#define CAN_ERFSR_ERFOVF_MASK                    (0x40000000U)
#define CAN_ERFSR_ERFOVF_SHIFT                   (30U)
#define CAN_ERFSR_ERFOVF(x)                      (((uint32_t)(((uint32_t)(x)) << CAN_ERFSR_ERFOVF_SHIFT)) & CAN_ERFSR_ERFOVF_MASK)
#define CAN_ERFSR_ERFUFW_MASK                    (0x80000000U)
#define CAN_ERFSR_ERFUFW_SHIFT                   (31U)
#define CAN_ERFSR_ERFUFW(x)                      (((uint32_t)(((uint32_t)(x)) << CAN_ERFSR_ERFUFW_SHIFT)) & CAN_ERFSR_ERFUFW_MASK)

/**
  * @}
  */

/** @name ERFCS -  Enhanced Message Buffer 0 CS Register..Enhanced Message Buffer 5 CS Register
  * @{
  */
#define CAN_ERFCS_TIME_STAMP_MASK                (0xFFFFU)
#define CAN_ERFCS_TIME_STAMP_SHIFT               (0U)
#define CAN_ERFCS_TIME_STAMP(x)                  (((uint32_t)(((uint32_t)(x)) << CAN_ERFCS_TIME_STAMP_SHIFT)) & CAN_ERFCS_TIME_STAMP_MASK)
#define CAN_ERFCS_DLC_MASK                       (0xF0000U)
#define CAN_ERFCS_DLC_SHIFT                      (16U)
#define CAN_ERFCS_DLC(x)                         (((uint32_t)(((uint32_t)(x)) << CAN_ERFCS_DLC_SHIFT)) & CAN_ERFCS_DLC_MASK)
#define CAN_ERFCS_RTR_MASK                       (0x100000U)
#define CAN_ERFCS_RTR_SHIFT                      (20U)
#define CAN_ERFCS_RTR(x)                         (((uint32_t)(((uint32_t)(x)) << CAN_ERFCS_RTRSHIFT)) & CAN_ERFCS_RTR_MASK)
#define CAN_ERFCS_IDE_MASK                       (0x200000U)
#define CAN_ERFCS_IDE_SHIFT                      (21U)
#define CAN_ERFCS_IDE(x)                         (((uint32_t)(((uint32_t)(x)) << CAN_ERFCS_IDE_SHIFT)) & CAN_ERFCS_IDE_MASK)
#define CAN_ERFCS_SRR_MASK                       (0x400000U)
#define CAN_ERFCS_SRR_SHIFT                      (22U)
#define CAN_ERFCS_SRR(x)                         (((uint32_t)(((uint32_t)(x)) << CAN_ERFCS_SRR_SHIFT)) & CAN_ERFCS_SRR_MASK)

#define CAN_ERFCS_ESI_MASK                       (0x20000000U)
#define CAN_ERFCS_ESI_SHIFT                      (29U)
#define CAN_ERFCS_ESI(x)                         (((uint32_t)(((uint32_t)(x)) << CAN_ERFCS_ESI_SHIFT)) & CAN_ERFCS_ESI_MASK)
#define CAN_ERFCS_BRS_MASK                       (0x40000000U)
#define CAN_ERFCS_BRS_SHIFT                      (30U)
#define CAN_ERFCS_BRS(x)                         (((uint32_t)(((uint32_t)(x)) << CAN_ERFCS_BRS_SHIFT)) & CAN_ERFCS_BRS_MASK)
#define CAN_ERFCS_EDL_MASK                       (0x80000000U)
#define CAN_ERFCS_EDL_SHIFT                      (31U)
#define CAN_ERFCS_EDL(x)                         (((uint32_t)(((uint32_t)(x)) << CAN_ERFCS_EDL_SHIFT)) & CAN_ERFCS_EDL_MASK)

/**
  * @}
  */

/* The count of CAN_ERFCS */
#define CAN_ERFCS_COUNT                          (6U)

/** @name ERFDID - Enhanced Message Buffer 0 ID Register..Enhanced Message Buffer 5 ID Register
  * @{
  */
#define CAN_ERFDID_EXT_MASK                      (0x3FFFFU)
#define CAN_ERFDID_EXT_SHIFT                     (0U)
#define CAN_ERFDID_EXT(x)                        (((uint32_t)(((uint32_t)(x)) << CAN_ERFDID_EXT_SHIFT)) & CAN_ERFDID_EXT_MASK)
#define CAN_ERFDID_STD_MASK                      (0x1FFC0000U)
#define CAN_ERFDID_STD_SHIFT                     (18U)
#define CAN_ERFDID_STD(x)                        (((uint32_t)(((uint32_t)(x)) << CAN_ERFDID_STD_SHIFT)) & CAN_ERFDID_STD_MASK)

/**
  * @}
  */

/* The count of CAN_ERFDID */
#define CAN_ERFDID_COUNT                             (6U)

/** @name ERFDWORD0 - Enhanced Message Buffer 0 WORD0 Register..Enhanced Message Buffer 5 WORD0 Register
  * @{
  */
#define CAN_ERFDWORD0_DATA_BYTE_3_MASK               (0xFFU)
#define CAN_ERFDWORD0_DATA_BYTE_3_SHIFT              (0U)
#define CAN_ERFDWORD0_DATA_BYTE_3(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD0_DATA_BYTE_3_SHIFT)) & CAN_ERFDWORD0_DATA_BYTE_3_MASK)
#define CAN_ERFDWORD0_DATA_BYTE_2_MASK               (0xFF00U)
#define CAN_ERFDWORD0_DATA_BYTE_2_SHIFT              (8U)
#define CAN_ERFDWORD0_DATA_BYTE_2(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD0_DATA_BYTE_2_SHIFT)) & CAN_WORD0_DATA_BYTE_2_MASK)
#define CAN_ERFDWORD0_DATA_BYTE_1_MASK               (0xFF0000U)
#define CAN_ERFDWORD0_DATA_BYTE_1_SHIFT              (16U)
#define CAN_ERFDWORD0_DATA_BYTE_1(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD0_DATA_BYTE_1_SHIFT)) & CAN_ERFDWORD0_DATA_BYTE_1_MASK)
#define CAN_ERFDWORD0_DATA_BYTE_0_MASK               (0xFF000000U)
#define CAN_ERFDWORD0_DATA_BYTE_0_SHIFT              (24U)
#define CAN_ERFDWORD0_DATA_BYTE_0(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD0_DATA_BYTE_0_SHIFT)) & CAN_ERFDWORD0_DATA_BYTE_0_MASK)

/**
  * @}
  */

/** @name ERFDWORD1 - Enhanced Message Buffer 0 WORD0 Register..Enhanced Message Buffer 5 WORD0 Register
  * @{
  */
#define CAN_ERFDWORD1_DATA_BYTE_7_MASK               (0xFFU)
#define CAN_ERFDWORD1_DATA_BYTE_7_SHIFT              (0U)
#define CAN_ERFDWORD1_DATA_BYTE_7(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD1_DATA_BYTE_7_SHIFT)) & CAN_ERFDWORD1_DATA_BYTE_7_MASK)
#define CAN_ERFDWORD1_DATA_BYTE_6_MASK               (0xFF00U)
#define CAN_ERFDWORD1_DATA_BYTE_6_SHIFT              (8U)
#define CAN_ERFDWORD1_DATA_BYTE_6(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD1_DATA_BYTE_6_SHIFT)) & CAN_ERFDWORD1_DATA_BYTE_6_MASK)
#define CAN_ERFDWORD1_DATA_BYTE_5_MASK               (0xFF0000U)
#define CAN_ERFDWORD1_DATA_BYTE_5_SHIFT              (16U)
#define CAN_ERFDWORD1_DATA_BYTE_5(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD1_DATA_BYTE_5_SHIFT)) & CAN_ERFDWORD1_DATA_BYTE_5_MASK)
#define CAN_ERFDWORD1_DATA_BYTE_4_MASK               (0xFF000000U)
#define CAN_ERFDWORD1_DATA_BYTE_4_SHIFT              (24U)
#define CAN_ERFDWORD1_DATA_BYTE_4(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD1_DATA_BYTE_4_SHIFT)) & CAN_ERFDWORD1_DATA_BYTE_4_MASK)

/**
  * @}
  */

/** @name ERFDWORD2 - Enhanced Message Buffer 0 WORD0 Register..Enhanced Message Buffer 5 WORD0 Register
  * @{
  */
#define CAN_ERFDWORD2_DATA_BYTE_11_MASK               (0xFFU)
#define CAN_ERFDWORD2_DATA_BYTE_11_SHIFT              (0U)
#define CAN_ERFDWORD2_DATA_BYTE_11(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD2_DATA_BYTE_11_SHIFT)) & CAN_ERFDWORD2_DATA_BYTE_11_MASK)
#define CAN_ERFDWORD2_DATA_BYTE_10_MASK               (0xFF00U)                                                                 
#define CAN_ERFDWORD2_DATA_BYTE_10_SHIFT              (8U)                                                                      
#define CAN_ERFDWORD2_DATA_BYTE_10(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD2_DATA_BYTE_10_SHIFT)) & CAN_ERFDWORD2_DATA_BYTE_10_MASK)
#define CAN_ERFDWORD2_DATA_BYTE_9_MASK               (0xFF0000U)                                                           
#define CAN_ERFDWORD2_DATA_BYTE_9_SHIFT              (16U)                                                                 
#define CAN_ERFDWORD2_DATA_BYTE_9(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD2_DATA_BYTE_9_SHIFT)) & CAN_ERFDWORD2_DATA_BYTE_9_MASK)
#define CAN_ERFDWORD2_DATA_BYTE_8_MASK               (0xFF000000U)                              
#define CAN_ERFDWORD2_DATA_BYTE_8_SHIFT              (24U)                                      
#define CAN_ERFDWORD2_DATA_BYTE_8(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD2_DATA_BYTE_8_SHIFT)) & CAN_ERFDWORD2_DATA_BYTE_8_MASK)

/**
  * @}
  */

