YuZane/ExpressTrain/Device/MM32F5330/Include/reg_flexcan.h
/** @name ERFDWORD13 - Enhanced Message Buffer 0 WORD0 Register..Enhanced Message Buffer 5 WORD0 Register
  * @{
  */
#define CAN_ERFDWORD13_DATA_BYTE_55_MASK               (0xFFU)
#define CAN_ERFDWORD13_DATA_BYTE_55_SHIFT              (0U)
#define CAN_ERFDWORD13_DATA_BYTE_55(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD13_DATA_BYTE_55_SHIFT)) & CAN_ERFDWORD13_DATA_BYTE_55_MASK)
#define CAN_ERFDWORD13_DATA_BYTE_54_MASK               (0xFF00U)                              
#define CAN_ERFDWORD13_DATA_BYTE_54_SHIFT              (8U)                                      
#define CAN_ERFDWORD13_DATA_BYTE_54(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD13_DATA_BYTE_54_SHIFT)) & CAN_ERFDWORD13_DATA_BYTE_54_MASK)
#define CAN_ERFDWORD13_DATA_BYTE_53_MASK               (0xFF0000U)                                 
#define CAN_ERFDWORD13_DATA_BYTE_53_SHIFT              (16U)                                       
#define CAN_ERFDWORD13_DATA_BYTE_53(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD13_DATA_BYTE_53_SHIFT)) & CAN_ERFDWORD13_DATA_BYTE_53_MASK)
#define CAN_ERFDWORD13_DATA_BYTE_52_MASK               (0xFF000000U)                            
#define CAN_ERFDWORD13_DATA_BYTE_52_SHIFT              (24U)                                    
#define CAN_ERFDWORD13_DATA_BYTE_52(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD13_DATA_BYTE_52_SHIFT)) & CAN_ERFDWORD13_DATA_BYTE_52_MASK)

/**
  * @}
  */

/** @name ERFDWORD14 - Enhanced Message Buffer 0 WORD0 Register..Enhanced Message Buffer 5 WORD0 Register
  * @{
  */
#define CAN_ERFDWORD14_DATA_BYTE_59_MASK               (0xFFU)
#define CAN_ERFDWORD14_DATA_BYTE_59_SHIFT              (0U)
#define CAN_ERFDWORD14_DATA_BYTE_59(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD14_DATA_BYTE_59_SHIFT)) & CAN_ERFDWORD14_DATA_BYTE_59_MASK)
#define CAN_ERFDWORD14_DATA_BYTE_58_MASK               (0xFF00U)                                 
#define CAN_ERFDWORD14_DATA_BYTE_58_SHIFT              (8U)                                      
#define CAN_ERFDWORD14_DATA_BYTE_58(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD14_DATA_BYTE_58_SHIFT)) & CAN_ERFDWORD14_DATA_BYTE_58_MASK)
#define CAN_ERFDWORD14_DATA_BYTE_57_MASK               (0xFF0000U)                                
#define CAN_ERFDWORD14_DATA_BYTE_57_SHIFT              (16U)                                      
#define CAN_ERFDWORD14_DATA_BYTE_57(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD14_DATA_BYTE_57_SHIFT)) & CAN_ERFDWORD14_DATA_BYTE_57_MASK)
#define CAN_ERFDWORD14_DATA_BYTE_56_MASK               (0xFF000000U)                             
#define CAN_ERFDWORD14_DATA_BYTE_56_SHIFT              (24U)                                     
#define CAN_ERFDWORD14_DATA_BYTE_56(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD14_DATA_BYTE_56_SHIFT)) & CAN_ERFDWORD14_DATA_BYTE_56_MASK)
                                                                                                   
/**
  * @}
  */


/** @name ERFDWORD15 - Enhanced Message Buffer 0 WORD0 Register..Enhanced Message Buffer 5 WORD0 Register
  * @{
  */
#define CAN_ERFDWORD15_DATA_BYTE_63_MASK               (0xFFU)
#define CAN_ERFDWORD15_DATA_BYTE_63_SHIFT              (0U)
#define CAN_ERFDWORD15_DATA_BYTE_63(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD15_DATA_BYTE_63_SHIFT)) & CAN_ERFDWORD15_DATA_BYTE_63_MASK)
#define CAN_ERFDWORD15_DATA_BYTE_62_MASK               (0xFF00U)                                 
#define CAN_ERFDWORD15_DATA_BYTE_62_SHIFT              (8U)                                      
#define CAN_ERFDWORD15_DATA_BYTE_62(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD15_DATA_BYTE_62_SHIFT)) & CAN_ERFDWORD15_DATA_BYTE_62_MASK)
#define CAN_ERFDWORD15_DATA_BYTE_61_MASK               (0xFF0000U)                                 
#define CAN_ERFDWORD15_DATA_BYTE_61_SHIFT              (16U)                                       
#define CAN_ERFDWORD15_DATA_BYTE_61(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD15_DATA_BYTE_61_SHIFT)) & CAN_ERFDWORD15_DATA_BYTE_61_MASK)
#define CAN_ERFDWORD15_DATA_BYTE_60_MASK               (0xFF000000U)                               
#define CAN_ERFDWORD15_DATA_BYTE_60_SHIFT              (24U)                                       
#define CAN_ERFDWORD15_DATA_BYTE_60(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_ERFDWORD15_DATA_BYTE_60_SHIFT)) & CAN_ERFDWORD15_DATA_BYTE_60_MASK)

/**
  * @}
  */


/** @name IHOFF -  Identifier receive filter hit indication
  * @{
  */
#define CAN_IHOFF_IDHIT_MASK                     (0x7FU)
#define CAN_IHOFF_IDHIT_SHIFT                    (0U)
#define CAN_IHOFF_IDHIT(x)                       (((uint32_t)(((uint32_t)(x)) << CAN_IHOFF_IDHIT_SHIFT)) & CAN_IHOFF_IDHIT_MASK)

/**
  * @}
  */

/* The count of CAN_IHOFF */
#define CAN_IHOFF_COUNT                          (6U)


/** @name ERFFEL0~1 -     Enhanced Rx FIFO Filter Element Registers 
  * @{
  */
#define CAN_ERFFEL_FEL_MASK                      (0xFFFFFFFFU)
#define CAN_ERFFEL_FEL_SHIFT                     (0U)
#define CAN_ERFFEL_FEL(x)                        (((uint32_t)(((uint32_t)(x)) << CAN_ERFFEL_FEL_SHIFT)) & CAN_ERFFEL_FEL_MASK)

/* The count of CAN_ERFFEL */
#define CAN_ERFFEL_COUNT                         (2U)

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/*----------------------------------------------------------------------------*/
#endif
/*----------------------------------------------------------------------------*/

